# Дальше будет реализация через арифметические действия с присваиванием.
#
#  33. Создать переменную item_3 и присвоить ей целое число
item_3 = 4
#  34. Прибавить 10 к item_3 с присвоением.
item_3 += 10
#  35. Вывести item_3 в консоль.
print('item_3 =', item_3)
#  36. Отнять 5 от item_3 с присвоением.
item_3 -= 5
#  37. Вывести item_3 в консоль.
print('item_3 =', item_3)
#  38. Умножить item_3 на 3 с присвоением.
item_3 *= 3
#  39. Вывести item_3 в консоль.
print('item_3 =', item_3)
#  40. Разделить item_3 на 2 с присвоением.
item_3 /= 2
#  41. Вывести item_3 в консоль.
print('item_3 =', item_3)
#  42. Возвести в степень 2 item_3 с присвоением.
item_3 **= 2
#  43. Вывести item_3 в консоль.
print('item_3 =', item_3)
#  44. Найти квадратный корень item_3 с присвоением.
item_3 **= 0.5
#  45. Вывести item_3 в консоль.
print('item_3 =', item_3)
#  46. Присвоить остаток от деления item_3
item_3 %= 13
#  47. Вывести item_3 в консоль.
print('item_3 =', item_3)